УРВ_файловая/src/Catalogs/Новости/Новости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Новости</name>
  <comment>Новости информационного центра</comment>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаАктуальности</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Пожелания</types>
    </type>
  </attributes>
  <attributes>
    <name>Приоритет</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Текст</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТекстHTML</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Публиковать</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Сервисы</name>
    <attributes>
      <name>Сервис</name>
      <type>
        <types>CatalogRef.Сервисы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Компоненты</name>
    <attributes>
      <name>Компонент</name>
      <type>
        <types>CatalogRef.КомпонентыСервиса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УРВ_файловая/src/WebServices/News_1_0_1/Module.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьНовости(ПрефиксСервиса, ИмяКонфигурации, ДатаНачала)

	УстановитьПривилегированныйРежим(Истина);
    
    Сервис = Справочники.Сервисы.НайтиПоРеквизиту("Префикс", ПрефиксСервиса);
    Если Не ЗначениеЗаполнено(Сервис) Тогда
        ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найден сервис по полученному префиксу - %1'"), ПрефиксСервиса); 
    КонецЕсли; 
    Конфигурация = Справочники.Конфигурации.НайтиПоРеквизиту("Имя", ИмяКонфигурации,, Сервис);
    Если Не ЗначениеЗаполнено(Конфигурация) Тогда
        ВызватьИсключение СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru='Не найдена конфигурация по имени - %1'"), ИмяКонфигурации); 
    КонецЕсли;
    
    Запрос = Новый Запрос;
    Запрос.Текст = 
    	"ВЫБРАТЬ РАЗЛИЧНЫЕ
        |   Новости.Ссылка КАК Новость
        |ИЗ
        |   Справочник.Новости КАК Новости
        |       ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Новости.Компоненты КАК НовостиКомпоненты
        |       ПО Новости.Ссылка = НовостиКомпоненты.Ссылка
        |ГДЕ
        |   Новости.Публиковать
        |   И Новости.ДатаСоздания > &ДатаНачала
        |   И Новости.Сервисы.Сервис = &Сервис
        |   И (НовостиКомпоненты.Компонент.Конфигурация = &Конфигурация
        |           ИЛИ НовостиКомпоненты.Компонент ЕСТЬ NULL)";
    
    Запрос.УстановитьПараметр("ДатаНачала", ДатаНачала);
    Запрос.УстановитьПараметр("Сервис", Сервис);
    Запрос.УстановитьПараметр("Конфигурация", Конфигурация);
    
    Результат = Запрос.Выполнить();
    Выборка = Результат.Выбрать();
	СписокНовостейТип = ФабрикаXDTO.Тип(ПространствоИмен(), "NewsList");
    НовостьТип = ФабрикаXDTO.Тип(ПространствоИмен(), "News");
    СписокНовостей = ФабрикаXDTO.Создать(СписокНовостейТип);
    
    Пока Выборка.Следующий() Цикл
        Новость = Выборка.Новость;
        НовостьXDTO = ФабрикаXDTO.Создать(НовостьТип);
        НовостьXDTO.name = Новость.Наименование;
        НовостьXDTO.startDate = Новость.ДатаСоздания;
    	НовостьXDTO.endDate = Новость.ДатаАктуальности; 
    	НовостьXDTO.id = Строка(Новость.Объект.УникальныйИдентификатор());
    	НовостьXDTO.criticality = ?(Новость.Приоритет = 0, 1, Новость.Приоритет);
        НовостьXDTO.textHTML = ВнешнийИнтерфейс.ОбъектHTMLObjectИзФорматированногоДокумента(Новость.ТекстHTML.Получить(), ПространствоИмен());
        СписокНовостей.News.Добавить(НовостьXDTO);
    КонецЦикла;
    
    Возврат СписокНовостей;
    
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПространствоИмен()
	
    Возврат "http://www.1cfresh.com/sd/news/1.0";	
	
КонецФункции
 
#КонецОбласти
